In [3]:
import os
import pandas as pd
import numpy as np

##### ADD NEW COLUMN (AGAIN)

###### ASSIGN

In [4]:
os.getcwd()
csv_path = os.path.join(os.getcwd(), "..", "..", "data", "StudentsPerformance.csv")

df_exams = pd.read_csv(csv_path)

In [5]:
score1 = np.random.randint(0, 100, size=1000)
score2 = np.random.randint(0, 100, size=1000)
type(score1)

numpy.ndarray

In [6]:
series1 = pd.Series(score1, index=np.arange(0,1000))
series2 = pd.Series(score2, index=np.arange(0,1000))
type(series1)

pandas.core.series.Series

In [7]:
series1

0      78
1      51
2      68
3      29
4      67
       ..
995    39
996    17
997    49
998    74
999    62
Length: 1000, dtype: int32

In [ ]:
# It creates a copy
df_exams.assign(NewColumn_Score1=score1)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,NewColumn_Score1
0,female,group B,bachelor's degree,standard,none,72,72,74,78
1,female,group C,some college,standard,completed,69,90,88,51
2,female,group B,master's degree,standard,none,90,95,93,68
3,male,group A,associate's degree,free/reduced,none,47,57,44,29
4,male,group C,some college,standard,none,76,78,75,67
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,39
996,male,group C,high school,free/reduced,none,62,55,55,17
997,female,group C,high school,free/reduced,completed,59,71,65,49
998,female,group D,some college,standard,completed,68,78,77,74
999,female,group D,some college,free/reduced,none,77,86,86,62

###### INSERT

In [ ]:
# It doesn't create a copy, it changes directly the original
df_exams.insert(1, "test", series2)
df_exams

,gender,test,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,60,group B,bachelor's degree,standard,none,72,72,74
1,female,24,group C,some college,standard,completed,69,90,88
2,female,53,group B,master's degree,standard,none,90,95,93
3,male,23,group A,associate's degree,free/reduced,none,47,57,44
4,male,14,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...,...
995,female,97,group E,master's degree,standard,completed,88,99,95
996,male,44,group C,high school,free/reduced,none,62,55,55
997,female,89,group C,high school,free/reduced,completed,59,71,65
998,female,49,group D,some college,standard,completed,68,78,77
999,female,53,group D,some college,free/reduced,none,77,86,86

##### RENAME COLUMNS AND INDEX

In [5]:
df_exams.rename(columns={"gender":"Gender"})

,Gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [ ]:
df_exams.rename(columns={"gender":"Gender",
                         "math score":"Math"}, inplace=True)

In [13]:
df_exams

,Gender,race/ethnicity,parental level of education,lunch,test preparation course,Math,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

###### INDEX

In [14]:
df_exams.rename(index={0:"A", 1:"B"})

,Gender,race/ethnicity,parental level of education,lunch,test preparation course,Math,reading score,writing score
A,female,group B,bachelor's degree,standard,none,72,72,74
B,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [15]:
new_df = df_exams.rename(index={0:"A", 1:"B"}).head(2)

In [16]:
new_df

,Gender,race/ethnicity,parental level of education,lunch,test preparation course,Math,reading score,writing score
A,female,group B,bachelor's degree,standard,none,72,72,74
B,female,group C,some college,standard,completed,69,90,88

In [17]:
import sys
print(sys.path)

['c:\\anaconda3\\envs\\python_DataScience\\python313.zip', 'c:\\anaconda3\\envs\\python_DataScience\\DLLs', 'c:\\anaconda3\\envs\\python_DataScience\\Lib', 'c:\\anaconda3\\envs\\python_DataScience', '', 'c:\\anaconda3\\envs\\python_DataScience\\Lib\\site-packages', 'C:\\Users\\Giacomo Da Re\\git\\Python_DataScience\\modules', 'c:\\anaconda3\\envs\\python_DataScience\\Lib\\site-packages\\win32', 'c:\\anaconda3\\envs\\python_DataScience\\Lib\\site-packages\\win32\\lib', 'c:\\anaconda3\\envs\\python_DataScience\\Lib\\site-packages\\Pythonwin']